export const pgnSamples = [
  // `corrcts`, پی جی ان های معمولی که باید درست نشان بدهد
  '1. d4 d5 (1... f6 2. h3 (2. b3 b6) (2. Nc3 a6) 2... h6 3. a3 (3. Bf4 e5 4. dxe5) (3. c4)) (1... c6) 2. f3 f6 (2... e6) 3. h4 (3. g3) (3. h3) 3... c5',
  `1. d4 d5 (1... f6 2. h3 (2. b3 b6) (2. Nc3 a6) 2... h6 (2... e6 3. f4 d5 (3... c5)) 3. a3 (3. Bf4 e5 4. dxe5) (3. c4) (3. g4)) (1... c6) 2. f3 (2. g3) 2... e5 3. dxe5 c5 4. c4 d4 5. e3 Nc6 6. exd4 Nxd4 7. Bd3`,
  // تست تعداد حرکت تا مات برای سفید و سیاه
  '[FEN "2k5/8/2K5/8/8/3R4/8/8 w - - 0 1"]', // سفید در2 حرکت مات می‌کند
  '[FEN "8/2k5/8/K7/8/3q4/8/8 w - - 0 1"]', // سیاه در ۴ حرکت مات می‌کند
  // تست ارتقا پیاده ای برای سفید هست برای سیاه نیست؟؟؟؟؟؟؟
  '[FEN "8/2P3k1/1K6/8/8/8/8/8 w - - 0 1"]', // سفید در یک حرکت ارتقا می‌دهد و در ۸ حرکت مات میکند
  'rnbqkbnr/pp2p1pp/5p2/2pp4/3P3P/5P2/PPP1P1P1/RNBQKBNR w KQkq - 0 4', // پوزیسیون ساده وسط بازی
  // برتری های سفید و سیاه که درست نشان بدهد
  // `unKnown`,
  `1. d4(1. d3) 1... d5(1... f6 2. h3(2. b3 b6)(2. Nc3 a6) 2... h6 3. a3)(3. Bf4 e5 4. dxe5)(3. c4)(1... c6) 2. f3 `,
  '1. d4 d5 (1... f6 2. h3 (2. b3 b6) (2. Nc3 a6) 2... h6 3. a3 (3. Bf4 e5 4. dxe5) (3. c4)) (1... c6) 2. f3',

  `1. d4 d5 (1... f6 2. h3 (2. b3 b6) (2. Nc3 a6) 2... h6 (2... e6 3. f4 d5 (3... c5)) 3. a3 (3. Bf4 e5 4. dxe5) (3. c4) (3. g4)) (1... c6) 2. f3 (2. g3)`,
];
